//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Rangt notandanafn eða lykilorð";
"_cancelled_by_user"                    = "Hætt við flutning";
"_error_folder_destiny_is_the_same_"    = "It is not possible to move the folder into itself";
"_error_not_permission_"                = "Þú hefur ekki heimild til að ljúka þessari aðgerð";
"_error_path_"                          = "Get ekki opnað þessa skrá eða möppu. Athugaðu hvort hún sé til";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "Heitið inniheldur að minnsta kosti einn ógildan staf";
"_not_connected_internet_"              = "Villa í tengingu við þjón";
"_not_possible_connect_to_server_"      = "Ekki er hægt að tengjast þjóninum í augnablikinu";
"_not_possible_create_folder_"          = "Tókst ekki að búa til möppu";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "Féll á tíma, reyndu aftur";
"_unknow_response_server_"              = "Óvænt svar frá þjóni";
"_user_autentication_required_"         = "Auðkenningar notanda er krafist";
"_file_directory_locked_"               = "Skrá eða mappa er læst";
"_ssl_certificate_untrusted_"           = "Skilríkið fyrir þennan þjón er ógilt";
"_internal_server_"                     = "Internal server error";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "Upprunaskráin fannst ekki á uppgefinni slóð";
"_folder_contents_nochanged_"           = "Innihald möppunnar hefur ekki breyst";
"_images_invalid_converted_"            = "Myndin er ógild og er ekki hægt að umbreyta í smámynd";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "Þjónninn ekki tiltækur í augnablikinu";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Mörkum geymslukvóta er náð";
"_ssl_connection_error_"                = "Villa við SSL-tengingu, reyndu aftur";
"_bad_request_"                         = "Ógild fyrirspurn";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


